["One for each other and all for one, The three brave amigos are we Brother to brother and everyone A brave amigo",
"Wherever they need us our destinies lead us Amigos, we're always together",
"Wherever we go we're three brave amigos And will be amigos forever",
"We are the Three Amigos And amigos forever We'll be",
"Rodrigo. Rodrigo, we will find the men we need in there.",
"We are from the village of Santa Poco. We have come here for your help.",
"A very great injustice has been done. A man named El Guapo,s threatening our very lives.",
"We are looking for men who are brave enough to stand up to this tyrant.",
"Senorita. Perhaps I can be of assistance. I'll help ya. But first you're gonna help me, darlin'.",
"Leave him alone! Get out of here! They are no better than El Guapo. They will not help us.",
"No one will help us. Rodrigo, you must have faith. The Holy Mother will help us.",
"With three men such as these, El Guapo would not dare to enter our village.",
"Goldsmith Pictures. Hollywood, California. The Three Amigos.",
"We have seen your deeds and think you are very great. We can pay you a hundred thousand pesos.",
"We do not have a hundred thousand pesos. Don't worry, Rodrigo. They will refuse it. But it would be an insult not to offer it to them.",
"One hundred thousand pesos if you come to Santa Poco and put on a show of your strength",
"…and stop the the horrible, evil, murdering, villainous monster, El Guapo so that once again we can be a peaceful village.",
"Twenty-three pesos. We only have ten. Okay. I give you the ten-pesos version.",
"You are great. One hundred thousand pesos. If you come to Santa Poco. Put on show.",
"Stop the, I'll put “infamous El Guapo.” Infamous? It means murderous, evil. All like you said. And it will save you money.",
"We've got to get back to basics. Shootin' for Love. Wanderers of the West. The Ride of the Three Amigos.",
"All the great Amigo pictures had one thing in common, three wealthy Spanish landowners who fight for the rights of peasants.",
"Now, that's something everyone likes. It's a people idea. It's a story a nation can sink its teeth into.",
"But then came Those Darn Amigos. A box office failure. Nobody went to see it.",
"Because nobody cares about three wealthy Spanish landowners on a weekend in Manhattan.",
"We strayed from the formula and we paid the price.",
"I thought we were quite good in it. Good? We were great.",
"Why don't you tell the boys about the Cochise picture, Morty?",
"Sandy and Irving are working on it right now. You meet Cochise. At first you think he's a terrible guy.",
"You fight, then you get to know him. You come to respect each other, and at the end of the picture you're friends.",
"We send you boys to Baja. We shoot the picture in eight days. What do you think?",
"That'll be the day. What did he say? He said, “That'll be the day,” Mr. Flugleman.",
"What? I don't think you understand who you're talking to here. We have a few items we want to straighten out first ",
"…or you might be looking at three actors who really don't feel like making a Geronimo picture.",
"What the hell are you talking about? Lucky, I think maybe we should...",
"What we're talking about is money, real money. Amigo money. No dough, no show. Boys. Boys.",
"Let me just say one thing. It'll be a cold day in hell when Harry Flugleman let's an actor tell him what to do!",
"Do you know what the word nada means? In all those Mexican movies you made did you ever hear that word?",
"Isn't that a light chicken gravy? It means nothing. Zero. Zip.",
"It's what you're gonna have when I'm through with you! You hit Harry Flugleman on a bad day.",
"I'd like to continue to work for free, Mr. Flugleman.",
"Are you living in the studio mansion? Yeah. Not anymore, you're not.",
"Sam! The Amigos are out of the mansion. Where did you get those clothes? From a movie?",
"Yeah, the studio gave them to us. Those Darn Amigos. Well, we're taking them back. Sam!",
"Get wardrobe over here right away. Take the Amigos' clothes. Wait a minute! You can't take our clothes.",
"You gave us these clothes. They were presents! Wait a minute! Lucky.",
"Wait a second. I think you misread who you're talking to here. Misread?",
"I want these schmucks off of my lot. Your * have just been streamlined.",
"The Three Amigos are history. You're through! And Mr. Flugleman says you're not to come back on this lot ever!",
"Look, boys, I know show business. Something always turns up. Telegram for the Three Amigos.",
"Three Amigos, Hollywood, California. You are very great.",
"One hundred thousand pesos to come to Santa Poco. Put on show. Stop. The infamous El Guapo.",
"What does that mean? “In-famous”? In-famous is when you're more than famous.",
"This man El Guapo is not just famous, he's in-famous.",
"A hundred thousand pesos to do a personal appearance with El Guapo, who is probably the biggest actor to ever come out of Mexico.",
"Wow. The in-famous? In-famous?",
"Wouldn't it be easier if we just asked Flugleman for our Amigo costumes?",
"No, Flugleman hates us right now. He's never gonna give us our costumes.",
"Lucky's right. This is the only way.",
"You two You You two Look Look up here, look up here Hey, you, look Up here Up here, up here Hey, you guys! This way.",
"Turn on the lights. Hey, what's goin' on up there? Let's go, Amigos. Adios!",
"I'm looking for a man by the name of El Guapo. Do you know this man? Perhaps, senor.",
"Where'd you get that pretty little gun?",
"El Guapo will be interested to see me. I have something he wants.",
"I'm talkin' to you. Where'd you get that pretty little gun?",
"I'm meeting some friends of mine here. When they get here, tell them to wait.",
"How will I know them? You will know them. You will most certainly know them.",
"Why don't you come over here and sit on my lap? I wanna show you something, honey.",
"Anyone else with a comment? Some friends of mine will be coming here.",
"I hope you will show them more courtesy than you have shown me.",
"They aren't as kindhearted as I am.",
"Looks like somebody's been down here with the ugly stick. Let's go.",
"Excuse us. We're not Mexicans. We're from out of town. We were wondering if you could tell us where the best hotel in town is.",
"There's no hotel in this town. Great. No hotel. I could kill somebody.",
"Excuse me. You are the Yes, we are. We have heard of you. No kidding.",
"I have a message for you. The German says to wait here. Hmm, yeah.",
"Well, so long as we've got some time to kill, I think I'll have a beer. We don't have no beer. Just tequila.",
"What's tequila? It's like beer. Is it fattening? Fattenings? Forget it. If it's like beer, we'll have some. Three tequilas.",
"Sure. Sure, amigos. Enjoy yourselves. But try not to get into too much trouble, okay?",
"Thank you. Hey there! It's an odd taste, isn't it? It's probably watered down.",
"There's something about this place. Everybody seems so grim. They're just intimidated.",
"They've only seen us on the big screen. We're just folks like you. Just relax.",
"Dusty, go on over to that piano. Oh, no. I haven't played in so long, I couldn't, really. Been a long time.",
"All right, we're gonna do a little number for you but remember, we're a bit rusty, so bear with us.",
"Just like the old days. All right. Maestro.",
"My little buttercup has the sweetest smile. Dear little buttercup won't you stay a while.",
"Come with me where moonbeams paint the sky. And you and I might linger In the sweet by-and-by.",
"Oh, dear little buttercup. With your eyes so blue. Oh, little buttercup. You're a dream come true.",
"You and I will settle down in a cottage built for two.",
"Oh, Dear little buttercup. I love you. Everybody!",
"My little buttercup. Has the sweetest. Smile. Hey, great.",
"Dear little buttercup. Won't you stay a... While, while!",
"You and I will settle down In a cottage built for two.",
"Oh, Dear little buttercup. Sweet. Little buttercup. My little buttercup. I love you",
"What'd I tell ya? Yeah, they loved us. What is that? It's a plane.",
"Not just any plane. It's a Tuppan 41. I flew one in Little Neddy Goes to War. What's it doing here?",
"I think it's a mail plane. How can you tell? Well, didn't you notice its little balls? The little balls hanging down.",
"The little The balls. The mail plane. It's a “male” plane. And the balls... Let's go find out where we're supposed to be.",
"Hey, look at the two little sissies! This town is getting too rough for me.",
"Carmen, the Three Amigos. I saw them coming out of the cantina. You are the Three Amigos? Yes, we are.",
"Told you we were big down here. Come. We will take you to Santa Poco. Great! Fine.",
"This is our village. Isn't that the Three Amigos? Do you think they can protect us from El Guapo? Welcome to Santa Poco.",
"Here you go. Dusty Bottoms. Can I have your watch when you are dead? What did he say?",
"Mmm, that's good. Very good. We are honored to have you in our home.",
"Do you have anything besides Mexican food?",
"Lucky, how's this show supposed to work anyway?",
"Well, I talked to Rodrigo tonight. He's the kid. He was kind of hazy on the details but as far as I can figure...",
"El Guapo's coming in a day or two. He rides in, acts like he owns the place.",
"We come out, put on a big show and pretend like we run him off.",
"It's pretty much what we did in Shootin' for Love.",
"Lucky. What are you gonna do with your share of the money?",
"A car. A big, shiny, silver car. I'll drive all over Hollywood, show Flugleman a thing or two.",
"What about you? New York. Maybe Paris. A lot of champagne. Parties. Be a big shot for a while. Yeah.",
"How 'bout you, Ned? I'm gonna start a foundation to help homeless children.",
"That occurred to me to do that at one point too. I meant I would do that first, and then I would get a big, shiny car.",
"Let's get some more tequila. El Guapo said to wait here. By the time he's here, we'll be back.",
"Let's go to Santa Poco. They'll be glad to see us!",
"Which one do you like best? I like the one who's not so smart. Which one is that?",
"Juanita. Bandidos! Bandidos! Sooner than expected. I must warn the Three Amigos. Bandidos!",
"They are coming! Who? El Guapo and his men. Already? Well, we'll start to get ready then.",
"Geez, they want us to do the show now. Weren't we going to have a rehearsal? Obviously not.",
"They've probably done it a million times, and we know what we're doing. Looks like there's about three of them.",
"Perfect. Rodrigo said there'd be 12 now there's 3. They better not cut our money.",
"Where's our tequila? We're waiting!",
"Say, those guys look pretty good. Are you kidding? They're doing every cliche in the book.",
"We'll give them seconds. I hope those horses they got for us are okay.",
"If I have to come into that cantina, somebody's gonna die!",
"Okay, Amigos, this is it. Ned, big smile. Dusty, relax and have fun with it. I'm just gonna have fun with it.",
"I'm Lucky Day. I'm Ned Nederlander. I'm Dusty Bottoms, and together we're... The Three Amigos!",
"Let's go! Well, you slime-eating dogs. you scum-sucking pigs. you sons of a motherless goat.",
"Son of a motherless goat? And who are you? Wherever there is injustice, you will find us.",
"Wherever there is suffering, we'll be there. Line. Wherever liberty is threatened, Wherever liberty is threatened...",
"you will find, The Three Amigos.",
"Who are these monkeys? I don't know. Should we kill them? No, let's go tell El Guapo what we've seen here.",
"And stay out. Nice show. Not bad for a matinee. * it, I forgot a line though. They'll never notice it.",
"They're really starved for entertainment around here.",
"I'm telling you, I've been in this situation before. Ask for the money now while they're excited.",
"You were magnificent. Oh! We were okay.",
"Then what happened? Then they got on their horses. They rode all over the town, shooting their pistolas up in the air.",
"And they called us scum-sucking pigs. Us! What should we do, El Guapo?",
"Tomorrow I will take men with me, find these three gringos, open their stomachs, grab their intestines and squeeze the * out of them!",
"Do you have a girlfriend back home, Dusty? We never really had time for that sort of thing, being so busy.",
"Have you ever kissed a girl? Oh, yeah. Sure, lots of times. Would you like to kiss me? Yeah. Well?",
"What, now? Here? We could take a walk, and you could kiss me on the veranda. Lips would be fine.",
"One time Dorothy Gish, was visiting me on the set of, Little Neddy, Grab Your Gun.",
"And she came up to me, and she looked me in the face. I'd never met her. I just know her from the films.",
"You know, Dorothy Gish, Lillian's sister. And she looked me in the eyes and she said, “Young man, you have got it.”",
"And UH! Dorothy Gish. It's a true story.",
"Next time we come here, I'm gonna ask for a different room.",
"Amigos, El Guapo himself is here, with all his men, just outside the village.",
"I have your horses waiting. You must ride against them now. What is she talking about?",
"I don't know. Looks like we got another show to do. Great. Let's get it over with. Yeah. Let's go.",
"They are so brave.",
"It's a pleasure working with you.",
"Well, you dirt-eating piece of slime, you scum-sucking pig, you son of a motherless goat.",
"Who are you? Wherever there is injustice, you will find us. Wherever there is suffering, we'll be there.",
"Tell us we will die like dogs. What? Tell us we will die like dogs. You will die like dogs. No, we will not die like dogs!",
"We will fight like lions. Because we are, The Three Amigos. Ride, caballeros! Ride, Amigos.",
"I like these guys. They are funny guys. Just kill one of them.",
"Hold it! Lucky? Geez, you all right? What happened? I don't know. Here. Oh, geez. Ow! Ow!",
"What? Wait a second. Let me see that. Come on, come on. Oh, great! Real bullets.",
"I'll keep this. You're in a lot of trouble, mister! Excuse me. It's real. What? This is real.",
"You mean, Yes. They're going to kill us. What am I doing in Mexico? I've been shot already. I know.",
"What are we gonna do? We're not gonna get paid, that's for sure. Let me talk to 'em, man to man. Yes.",
"Mr. Guapo, I'd just like to say, on behalf of the Three Amigos, we're very, very sorry and we'd like to go home now.",
"You see, sir, we're not gunfighters. We're movie stars. Movie stars? Yeah, actors, entertainers.",
"You know, we sing and dance. Yeah, you know, My little buttercup Has the sweetest smile",
"Don't you want to die like dogs? Well, if there's any way of avoiding that part of it",
"El Guapo only kills men. He does not kill crying women. So go, you big movie stars. Thank you. Faster!",
"People of Santa Poco. You were very foolish to bring men to try to stop El Guapo. You have hurt me.",
"You see, Jefe? A rose can bloom in the desert.",
"Jefe! Santa Poco is no longer under my protection! The town is yours, muchachos!",
"Afternoon. We'll just get our things and go. There is nothing of yours here. El Guapo has taken everything. Sorry.",
"Did you see a pair of cuff links? They were mother-of-pearl. Where's Carmen? El Guapo has taken her too.",
"Let's go back to Hollywood. The sooner, the better. It's too hot down here. That and my hay fever.",
"We don't belong down here anyway. Where's Ned? What are you doing? What do we have to go back to?",
"You've no jobs, no money no place to live. No friends. No women. No self-respect. Oh, hold on. Wait.",
"Ned, we could get killed. Back there the Three Amigos are already dead. Here we could be the Three Amigos for real.",
"I'm drawing a line. Men or mice? What'll it be?",
"Let's ride!",
"Great job catching the food, Ned. Oh, thanks, Lucky.",
"How do you like your bat, Dusty? Medium rare. This should do it. Thanks.",
"How far did we ride before we had to go back and get directions? Just three or four miles.",
"Read those instructions again. All righty. All right. We go east through the desert until we come to the singing bush.",
"The singing bush? When we find the singing bush we say the magic chant, each fire one shot in the air",
"and that will summon the invisible swordsman and he will then show us the way to El Guapo's.",
"Want your wings? No, fine. Here you go. Oh, great, thanks. Well, good night.",
"Look at the little fella. He's tuckered out already. What was that? It's just a coyote.",
"I've never slept outside before. Take it easy.",
"Arizona moon keep shinin' from the desert sky above.",
"You know, pretty soon that big yellow moon, will light the way back to the one you love.",
"Blue shadows on the trail, little cowboy close your eyes and dream.",
"All of the doggies are in the corral all of your work is done.",
"Just close your eyes and dream, little pal dream of someone.",
"Blue Shadows On the trail Soft wind blowin' Through the trees Above",
"All the other little cowboys Back in the bunkhouse now, so Close your Eyes and Dream",
"Good night, Lucky. Good night, Dusty. Good night, Ned. Good night, Ned. Good night, Ned.",
"Lip balm?",
"Excuse me. Are you the singing bush? Follow the sea Yea, ho, blow the man down",
"Pay attention and listen to me Let me talk to him. Excuse us. Are you the singing bush? Yea, ho, blow the man down",
"Hello? Hi! Give me some time to blow the man down. Excuse us! Good night, ladies Good night, ladies.",
"Forget it. My guess is this is the singing bush. Let's go summon the invisible swordsman.",
"Summon the invisible swordsman? I can't believe I'm doing this.",
"Now let me see here. We each have to fire one shot in the air say the magic chant and the invisible swordsman will appear.",
"Great! You've killed the invisible swordsman.",
"He's dead. How was I supposed to know where he was?",
"You were supposed to fire up. We both fired up! It's like living with a six-year-old.",
"Now we'll never find El Guapo's. He was the only one who could show the way. We're lost.",
"It's the Tuppan 41 we saw in Diablo. I'll bet it's going to El Guapo's.",
"Mount up! It means, get on your horses.",
"Carmen, today is El Guapo's birthday and tonight, you are to be El Guapo's woman.",
"I would sooner die. Let me prepare you for the way El Guapo makes love.",
"Tell me, Carmen, do you know what foreplay is? Good. Neither does El Guapo.",
"Jefe, the German arrive yet? Not yet, El Guapo.",
"Many presents have been coming for your birthday. German has the only presents I want: Guns.",
"Guns under the name of El Guapo will be hanging on everyone's lips.",
"He will be here, Guapo but I think you will like your other presents too.",
"I have put many beautiful piñatas in the storeroom each of them filled with little surprises.",
"Many pinatas? Oh, yes, many. Would you say I have a plethora of pinatas? A what?",
"A plethora. Oh, yes, you have a plethora. Jefe, what is a “plethora”? Why?",
"You told me I have a plethora, and I just would like to know if you know what a plethora is.",
"I would not like to think that a person would tell someone, he has a plethora, and find out that that person has no idea what it means to have a plethora.",
"Forgive me, El Guapo. I know that I, Jefe, do not have your superior intellect and education.",
"But could it be that, once again you are angry at something else and are looking to take it out on me?",
"Like what, Jefe? Could it be because you are turning today?",
"Could it be because Carmen chooses to sleep in her cell instead of with you?",
"Why don't you just take her? When you want cattle, you take the cattle. When you want food, you take the food.",
"When you want a woman you just take the woman. Why don't you just take her? You do not understand women.",
"You cannot force open the petals of a flower. When the flower is ready, it opens itself up to you.",
"When do you think Carmen will open up her flower to you? Tonight, or I will kill her.",
"There is the German now, right on time. We must make him welcome. This way, boys.",
"Stay. Down. My God. We're gonna have to figure out a wy to get inside. It looks impossible.",
"Lucky, those walls are 30 feet high. There's a guard at every post. There's no way we'll ever get in there.",
"I think Dusty's right. We're gonna have to use our brains. * it.",
"Here come the guns! Jefe, what's his name? That's Paco. Paco! Take off your hat. Hold it up! Higher!",
"You lived up to your promise. You will be my guest at the celebration today. A little party my men are throwing for me.",
"This is where we'll climb up. What about that guard? I'll throw a rock and distract him. Okay.",
"But I would throw it out there, maybe toward that tree. Wait a second. No, in the dry riverbed. They're. Let's go.",
"You like it? Seize him! So far, so good.",
"What was that noise? I do not know.",
"I have three demands. One: That you stop harassing the people of Santa Poco.",
"Two: That the land of Mexico be redistributed equally among the people and a proportional system of government be established",
"…consisting of three separate, but equal, branches the legislative, the executive and the judicial.",
"And three: That the girl Carmen be returned to me unharmed.",
"Amigo, why you come here? You don't belong. Now we have to kill you. Take him away.",
"Excuse me, did you say kill me?",
"Under my system, you would no longer be under the thumb of El Guapo, but you would be free to determine your own destiny.",
"You see, under a strong federal system, you have certain rights. For example, owning property.",
"You two could have a beautiful little castle on the mesa.",
"You know, I can see it now, with your little bambinos running everywhere, playing in the yard.",
"We have a plan. What is it? First, we break into El Guapo's fortress. And that you've done. Now what?",
"Well, we really didn't expect the first part of the plan to work so we have no further plan.",
"Sometimes you can overplan these things.",
"So give me a second to talk to Lucky. I'll get back to you.",
"Wait! There's a guard outside the door. Quick!",
"You must dress in his clothes. Then you will be able to move freely in the courtyard. Got it.",
"Ow! Ow! Easy. Come and get 'em. So I just wait here then?",
"Okay, you go get the horses. Meet us out front. That's a good plan. Thank you.",
"A toast to El Guapo. Today, he is… 29 years old!",
"On behalf of myself, Jefe, and the rest of the boys, we chipped in and, got you this gift.",
"What can you say about such men? It's a sweater!",
"Gonna make it. Gonna make it. Gonna make it. I made it!",
"My men, my compadres what we have done, we have done together.",
"I know each one of you like I know my own smell. We fought together the priests of this mission.",
"We crushed the federales on the plains of Oaxaca.",
"Jose! Together, we. Burned the village! Burned the village! And. Raped the horses!",
"And we. Rode off on the women! Rode off on the women! And. We plundered! Plundered!",
"And. Pruned. Pruned the. Hedges. Hedges. Of many small villages. Of many small villages. Who the hell are you?",
"Another one of the * gringos. Take this monkey away! Put him with the other Yankee maricon.",
"What is happening around here today? Are gringos falling from the sky? Yes, El Guapo.",
"Now we have all the Amigos. Take 'em away. One moment, please. I know who this man is. You do?",
"Yes, it is Ned Nederlander. Who? You are my favorite star of the silver screen. Really?",
"In Germany, the cinema is very popular. I've seen all of your films",
"Including when you were known as “Little Neddy Knickers.” Well, that was a long time ago.",
"It was this man who inspired me to learn the art of the quick draw. I looked up to this man.",
"I studied his every move. It was my dream to be as fast as Ned Nederlander.",
"I practiced every day for hours and hours. He was a god to me. A god? Well, I don't know about that.",
"But it is nice to meet a fan. You know, often I think. Then I found out about movie tricks.",
"Trick photography. I was crushed. I never used trick photography.",
"That is impossible. No one can be as fast as you appear to be. I am that fast.",
"We shall see. Happy to. Does anybody have a watch? Preferably one with a second hand.",
"I got a stopwatch. No stopwatch. As you Americans say, “We will play for keeps.”",
"Give me back his gun. Leave him here. He might like to see his friend die. I've seen it.",
"You don't understand. I don't shoot at people. You see, it's against my upbringing.",
"Call it etiquette, whatever. You know, I was thinking. I've waited for years for this moment.",
"You wanna die with a man's gun. Not a little sissy gun like this. Enough! Take the gun! Let's go!",
"I have had enough of this, Yankees. Not so fast, El Guapo! Or I'll fill you so full of lead, you'll be using your * for a pencil.",
"What do you mean? I don't know! I think he means that if you... Shut up!",
"So, you thought you could outsmart the Amigos. Well, not this time. Dusty, cover El Guapo.",
"Now, everybody, throw down your guns. Do as he says! Not you, Dusty. Sorry.",
"Okay, now, everybody lay down and put your hands behind your head.",
"Ned, open the gates! And don't try to touch those guns!",
"Kill them! Hurry up! Hurry up! Ride, Amigos, ride! What luck! It's a Tuppan41.",
"You can fly one. Yeah. Didn't you fly one in Little Neddy Goes to War? Well, not exactly.",
"Actually, my stuntman did. I'm pretty sure I can remember. Look out, Ned. My God!",
"So long, El Guapo! I will see you in Santa Poco. Santa Poco! Ned, land. Hold it. El Guapo is on his way.",
"Someday the people of this village will have to face El Guapo. We might as well do it now.",
"In a way, all of us have an El Guapo to face someday. For some, shyness might be their El Guapo.",
"For others, a lack of education might be their El Guapo. For us, El Guapo is a big dangerous guy who wants to kill us.",
"But as sure as my name is Lucky Day, the people of Santa Poco can conquer their own personal El Guapo",
"who also happens to be the actual El Guapo. We want to defend ourselves. But how?",
"By using the skills and the talents of the people of Santa Poco. This is not a town of weaklings.",
"You can turn your skills against El Guapo. Now what is it that this town really does well?",
"We can sew. There you go. You can sew. If only we had known this earlier.",
"Ned, Dusty. Sewing. Remember our film, Amigos, Amigos, Amigos? Yes.",
"Remember what we did in that movie? Gee, do you think it could work? It's got to work.",
"It's our only hope. Sew, very old one. Sew like the wind. Okay, dig here.",
"Where are you? There they are, El Guapo! Now they're over there, El Guapo. Now they're over there. Shoot 'em!",
"They're over there. Now they're over here. What the hell is happening around here? Shoot, shoot!",
"Now they're over there, on top of the church. They are everywhere. They're over there too.",
"Come back, you cowards! You traitors! I'm still here, El Guapo. You stupid horse!",
"That was some good trick. Come closer. I have something to tell you. That was a good trick too.",
"I'm gonna miss you, Senor Dusty. I'm gonna miss you, too, Pablo. Here. I want you to have my watch.",
"I wanna go with you. No, Pablo, there's still much to be done here. Your village needs you.",
"And your family needs you. We are men without homes. We were meant to wander.",
"You will always have a home here with us in Santa Poco.",
"Good-bye, Dusty. You have done what you said you would do.",
"Long will the memory of the Three Amigos live in the hearts of the people of Santa Poco.",
"I'll come back one day. Why? Well, I thought that maybe you and I could...",
"Let's ride.",
"We are proud to give you all that we have. Here, I'll take that.",
"Our reward is that justice has been done.",
"And remember: Wherever there is injustice, you will find us.",
"Wherever there is suffering, we'll be there.",
"Wherever liberty is threatened, you will find, The Three Amigos! Let's ride! Let's ride!"
]
